summerwunder/A-Smart-Home-Monitoring-based-on-stm32-and-ESP8266-/Hardware/ADC/ADC.c
#include "stm32f10x.h"                  // Device header
#include "ADC.h"

void ADC1_Init(void)
{
    RCC_APB2PeriphClockCmd(ADC_RCC_PORT,ENABLE);
    RCC_APB2PeriphClockCmd(ADC_GPIO_RCC_PORT,ENABLE);

    RCC_ADCCLKConfig(RCC_PCLK2_Div6);
 
    
    GPIO_InitTypeDef GPIO_InitStructure;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
    GPIO_InitStructure.GPIO_Pin = ADC_GPIO_PIN;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(ADC_GPIO_PORT, &GPIO_InitStructure);
    
    //ADC_RegularChannelConfig(ADC1, ADC_CHANNEL, 1, ADC_SampleTime_55Cycles5);
    ADC_RegularChannelConfig(ADC1, ADC_Channel_8, 1, ADC_SampleTime_55Cycles5);//PB0
    /*   ADC初始化 */
    ADC_InitTypeDef ADC_InitStructure;
    ADC_InitStructure.ADC_ContinuousConvMode=DISABLE;
    ADC_InitStructure.ADC_DataAlign= ADC_DataAlign_Right;
    ADC_InitStructure.ADC_ExternalTrigConv=ADC_ExternalTrigConv_None;
    ADC_InitStructure.ADC_Mode= ADC_Mode_Independent;
    ADC_InitStructure.ADC_NbrOfChannel=1;
    ADC_InitStructure.ADC_ScanConvMode=DISABLE;
    
    ADC_Init(ADC1,&ADC_InitStructure);
    ADC_Cmd(ADC1,ENABLE);
    /*校正*/
    ADC_ResetCalibration(ADC1);
    while (ADC_GetResetCalibrationStatus(ADC1) == SET);
    ADC_StartCalibration(ADC1);
    while(ADC_GetCalibrationStatus(ADC1)==SET);
}

uint16_t ADC1_GetValue(void)
{
    ADC_SoftwareStartConvCmd(ADC1,ENABLE);
    while (ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC) == RESET);
    return ADC_GetConversionValue(ADC1);
}
